---
type: FamilyStructuralMaterialTypeFilter
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 3
tags: [revit-api, class]
---

# FamilyStructuralMaterialTypeFilter

`Autodesk.Revit.DB.Structure.FamilyStructuralMaterialTypeFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FamilyStructuralMaterialTypeFilter | — | `` |
| Method | PassesFilter | — | `` |
| Property | StructuralMaterialType | 2011 | `public StructuralMaterialType StructuralMaterialType { get ; }` |